In [73]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import missingno as msno

In [96]:
data = pd.read_csv('dataset.csv')

data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [ ]:
data['smoker'].value_counts(normalize=True).plot(kind='pie')

In [ ]:
BMI = data['bmi'].min()
pas = 2

data[(BMI<= data['bmi']) & (data['bmi']<BMI+pas)].value_counts()

In [ ]:
BMI = data['bmi'].min()
pas = 2
print(BMI)
while BMI < data['bmi'].max():
    print(data[(BMI<= data['bmi']) & (data['bmi']<BMI+pas)].shape)
    BMI += pas

In [98]:
bins = [0,18,25,30,35,40,50,60]
labels=['sous poids','poids normal','surpoids','obésité modérée','obésité sévère','obésité morbide','obésité massive']

data['BMI_cat']=pd.cut(data['bmi'], bins=bins, labels=labels, right=False)

data[data['bmi']>50]

,age,sex,bmi,children,smoker,region,charges,BMI_cat
847,23,male,50.38,1,no,southeast,2438.0552,obésité massive
1047,22,male,52.58,1,yes,southeast,44501.3982,obésité massive
1317,18,male,53.13,0,no,southeast,1163.4627,obésité massive

In [ ]:
plt.scatter(data[data['smoker']=='yes'][['age']], data[data['smoker']=='yes'][['charges']])
plt.scatter(data[data['smoker']=='no'][['age']], data[data['smoker']=='no'][['charges']])
plt.show()

In [ ]:
data.boxplot(column="charges", vert=False)
plt.show()

In [ ]:
msno.bar(data)

In [ ]:
msno.heatmap(data)

In [74]:
data = pd.read_csv('4072eb5e-e963-4a17-a794-3ea028d0a9c4.csv')

data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [75]:
#Vérification des valeurs nulles
print(data.isnull().sum())

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [76]:
#fonction describe

data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [83]:
#vérification des doublons

data.loc[data.duplicated(keep=False),:]

     age   sex    bmi  children smoker     region    charges
195   19  male  30.59         0     no  northwest  1639.5631
581   19  male  30.59         0     no  northwest  1639.5631

In [84]:
#suppression du doublon

data.drop_duplicates(inplace=True, ignore_index=True)

In [90]:
#vérifier type des colonnes
data.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

In [92]:
unique_region = data['region'].unique()
print(unique_region)

['southwest' 'southeast' 'northwest' 'northeast']